# Data Transformation using Pandas
### Data Science Pipeline Workshop 11 Juni 2022
- Author : Randy Galawana
- Email  : randy_galawana1@telkomsel.co.id

&copy; Telkomsel 2022

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/imdb_database.csv')

In [3]:
df.columns

Index(['movie_ID', 'movie_title', 'duration', 'color', 'title_year', 'country',
       'language', 'content_rating', 'budget_USD', 'gross_USD', 'net_USD',
       'profitable', 'director_name', 'director_top20?', 'director_facebook?',
       'director_facebook_likes', 'actor_1_name', 'actor_top20?',
       'actor_1_facebook?', 'actor_1_facebook_likes', 'actor_2_name',
       'actor_top20?.1', 'actor_2_facebook?', 'actor_2_facebook_likes',
       'actor_3_name', 'actor_top20?.2', 'actor_3_facebook?',
       'actor_3_facebook_likes', 'cast_total_facebook_likes',
       'movie_facebook?', 'movie_facebook_likes;', 'facenumber_in_poster',
       'num_voted_users', 'num_user_for_reviews', 'imdb_score',
       'imdb_top_250'],
      dtype='object')

In [4]:
df.head()

,movie_ID,movie_title,duration,color,title_year,country,language,content_rating,budget_USD,gross_USD,...,actor_3_facebook?,actor_3_facebook_likes,cast_total_facebook_likes,movie_facebook?,movie_facebook_likes;,facenumber_in_poster,num_voted_users,num_user_for_reviews,imdb_score,imdb_top_250
0,1,Avatar,178,1,2009,USA,English,PG-13,237000000,760505847,...,1,855,4834,1,33000,0,886204,3054,7.9,0
1,2,Pirates of the Caribbean: At World's End,169,1,2007,USA,English,PG-13,300000000,309404152,...,1,1000,48350,0,0,0,471220,1238,7.1,0
2,3,The Dark Knight Rises,164,1,2012,USA,English,PG-13,250000000,448130642,...,1,23000,106759,1,164000,0,1144337,2701,8.5,1
3,4,Spider-Man 3,156,1,2007,USA,English,PG-13,258000000,336530303,...,1,4000,46055,0,0,0,383056,1902,6.2,0
4,5,Batman v Superman: Dawn of Justice,183,1,2016,USA,English,PG-13,250000000,330249062,...,1,2000,24450,1,197000,0,371639,3018,6.9,0

### Pivot

In [15]:
df['country_group'] = df['country'].apply(lambda x: x if x in ['USA', 'Hong Kong', 'Japan', 'UK'] else 'Others')
df['budget_USD_mio'] = df['budget_USD']/1000000

In [21]:
df_pivot = df.pivot_table(index='title_year', columns='country_group', values='budget_USD_mio').reset_index()

In [22]:
df_pivot.fillna(0, inplace=True)

In [23]:
df_pivot[df_pivot['title_year'] > 1990]

country_group,title_year,Hong Kong,Japan,Others,UK,USA
47,1991,0.0,0.000000,40.000000,0.000000,28.065767
48,1992,0.0,0.000000,8.000000,6.433333,28.624379
49,1993,0.0,0.000000,19.500000,20.500000,21.826471
50,1994,2.0,35.000000,21.000000,17.250000,33.355227
51,1995,7.5,32.000000,34.750000,25.000000,34.051316
52,1996,0.0,0.000000,14.010000,15.583333,35.864524
53,1997,0.0,2400.000000,18.758750,34.250000,42.140517
54,1998,0.0,0.000000,61.733333,26.642857,37.956129
55,1999,0.0,1000.000000,50.341667,32.445833,32.697732
56,2000,0.0,0.000000,29.680667,16.458333,39.079746
57,2001,10.0,19.000000,53.910870,26.650000,35.909371
58,2002,0.0,0.000000,20.828000,34.642865,36.274829
59,2003,41.0,0.000000,28.607684,27.375000,41.985668
60,2004,16.0,1075.759949,24.760173,30.640000,43.755128
61,2005,0.0,0.000000,259.850219,32.075636,38.366785
62,2006,35.0,0.000000,363.796154,44.686667,35.772328
63,2007,28.0,0.000000,17.092000,35.357143,44.397540
64,2008,0.0,30.500000,73.056600,30.700000,43.955072
65,2009,65.0,0.000000,21.875185,44.330000,45.408229
66,2010,0.0,0.000000,22.705000,33.808333,52.379393
67,2011,0.0,0.000000,25.797917,20.301333,50.203591
68,2012,0.0,0.000000,23.796023,57.200000,49.572788
69,2013,38.6,5.500000,27.717647,31.346154,56.786588
70,2014,0.0,0.000000,45.321429,48.600000,51.032302
71,2015,36.0,35.000000,50.766667,45.818182,58.331147
72,2016,0.0,75.000000,8.300000,79.250000,73.198000

### Melt

In [26]:
df_test = df[['movie_ID', 'movie_title', 'content_rating', 'language', 'color']].sample(n=10)

In [27]:
df_test

      movie_ID                    movie_title content_rating language  color
939        940              The Young Messiah          PG-13  English      1
2632      2633        The Long Kiss Goodnight              R  English      1
724        725         No Country for Old Men              R  English      1
3240      3241                A Lot Like Love          PG-13  English      1
3293      3294                       Faithful              R  English      1
3594      3595                     Bon voyage          PG-13   French      0
0            1                         Avatar          PG-13  English      1
2230      2231            Freddy Got Fingered              R  English      1
1698      1699               Tears of the Sun              R  English      1
789        790  The Bridges of Madison County          PG-13  English      1

In [31]:
df_melt = df_test.melt(id_vars=['movie_ID', 'movie_title'], var_name='option', value_name='value')

In [32]:
df_melt.head(10)

   movie_ID                    movie_title          option  value
0       940              The Young Messiah  content_rating  PG-13
1      2633        The Long Kiss Goodnight  content_rating      R
2       725         No Country for Old Men  content_rating      R
3      3241                A Lot Like Love  content_rating  PG-13
4      3294                       Faithful  content_rating      R
5      3595                     Bon voyage  content_rating  PG-13
6         1                         Avatar  content_rating  PG-13
7      2231            Freddy Got Fingered  content_rating      R
8      1699               Tears of the Sun  content_rating      R
9       790  The Bridges of Madison County  content_rating  PG-13

### stack
only working with multi indexed dataframe, ex : pivotted dataframe

In [34]:
df_pivot = df.pivot_table(index=['title_year', 'color'], columns='country_group', values='budget_USD_mio')

In [40]:
df_stack = df_pivot.stack(level=-1, dropna=False)
df_stack

title_year  color  country_group
1927        0      Hong Kong           NaN
                   Japan               NaN
                   Others            6.000
                   UK                  NaN
                   USA                 NaN
                                     ...
2016        1      Hong Kong           NaN
                   Japan            75.000
                   Others            8.300
                   UK               79.250
                   USA              73.198
Length: 530, dtype: float64

### Unstack
only working with indexed data, ex Stack, Pivot

In [46]:
df_stack.unstack('color')

color                       0       1
title_year country_group
1927       Hong Kong      NaN     NaN
           Japan          NaN     NaN
           Others         6.0     NaN
           UK             NaN     NaN
           USA            NaN     NaN
...                       ...     ...
2016       Hong Kong      NaN     NaN
           Japan          NaN  75.000
           Others         NaN   8.300
           UK             NaN  79.250
           USA            NaN  73.198

[365 rows x 2 columns]

In [45]:
df_stack.unstack('title_year')

title_year           1927   1929   1933   1935  1936  1937   1939  1940  1946  \
color country_group
0     Hong Kong       NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      Japan           NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      Others          6.0    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      UK              NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      USA             NaN  0.379  0.439  0.609   1.5   NaN  2.800   NaN   2.1
1     Hong Kong       NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      Japan           NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      Others          NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      UK              NaN    NaN    NaN    NaN   NaN   NaN    NaN   NaN   NaN
      USA             NaN    NaN    NaN    NaN   NaN   2.0  3.977   2.6   8.0

title_year           1947  ...       2007       2008       2009       2010  \
color country_group        ...
0     Hong Kong       NaN  ...        NaN        NaN        NaN        NaN
      Japan           NaN  ...        NaN        NaN        NaN        NaN
      Others          NaN  ...        NaN        NaN  12.166667        NaN
      UK              NaN  ...   3.250000        NaN        NaN        NaN
      USA             2.3  ...  20.000000  40.000000  70.000000        NaN
1     Hong Kong       NaN  ...  28.000000        NaN  65.000000        NaN
      Japan           NaN  ...        NaN  30.500000        NaN        NaN
      Others          NaN  ...  17.092000  73.056600  23.088750  22.705000
      UK              NaN  ...  40.708333  30.700000  44.330000  33.808333
      USA             NaN  ...  44.595894  43.983942  45.061866  52.379393

title_year                2011       2012       2013       2014       2015  \
color country_group
0     Hong Kong            NaN        NaN        NaN        NaN        NaN
      Japan                NaN        NaN        NaN        NaN        NaN
      Others         10.500000        NaN        NaN  25.000000        NaN
      UK                   NaN        NaN        NaN        NaN  15.000000
      USA            66.000000  24.000000  12.000000  65.000000        NaN
1     Hong Kong            NaN        NaN  38.600000        NaN  36.000000
      Japan                NaN        NaN   5.500000        NaN  35.000000
      Others         27.188636  23.796023  27.717647  46.884615  50.766667
      UK             20.301333  57.200000  31.346154  48.600000  48.900000
      USA            50.083008  50.341895  57.125880  50.920560  58.331147

title_year             2016
color country_group
0     Hong Kong         NaN
      Japan             NaN
      Others            NaN
      UK                NaN
      USA               NaN
1     Hong Kong         NaN
      Japan          75.000
      Others          8.300
      UK             79.250
      USA            73.198

[10 rows x 73 columns]

### Merge / Join

In [53]:
df_listings = pd.read_csv('data/airbnb_listings.csv')[['id', 'host_id', 'host_name', 'price', 'name', 'minimum_nights']]

In [54]:
df_listings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2830 entries, 0 to 2829
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              2830 non-null   int64
 1   host_id         2830 non-null   int64
 2   host_name       2830 non-null   object
 3   price           2830 non-null   int64
 4   name            2830 non-null   object
 5   minimum_nights  2830 non-null   int64
dtypes: int64(4), object(2)
memory usage: 132.8+ KB

In [71]:
df_listings.shape

(2830, 6)

In [64]:
df_reviews = pd.read_csv('data/airbnb_reviews.csv').sample(frac=0.4)
df_reviews.rename(columns={'date':'review_date'}, inplace=True)
df_reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18878 entries, 15193 to 8273
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   18878 non-null  int64
 1   review_date  18878 non-null  object
dtypes: int64(1), object(1)
memory usage: 442.5+ KB

In [70]:
df_reviews.shape

(18878, 2)

#### Inner Join

In [65]:
df_listings.rename(columns={'id':'listing_id'}, inplace=True)

In [66]:
df_join_inner = df_reviews.merge(df_listings, on='listing_id', how='inner')

In [67]:
df_join_inner.head()

,listing_id,review_date,host_id,host_name,price,name,minimum_nights
0,10068252,2017-03-10,51172579,Nathalie,101,Horse Cottage # 5,1
1,10068252,2021-10-22,51172579,Nathalie,101,Horse Cottage # 5,1
2,10068252,2019-02-15,51172579,Nathalie,101,Horse Cottage # 5,1
3,10068252,2018-05-22,51172579,Nathalie,101,Horse Cottage # 5,1
4,10068252,2018-01-03,51172579,Nathalie,101,Horse Cottage # 5,1

In [68]:
# the number of rows is same with df_reviews, it means every listing_id in df_reviews has pair in df_listings
df_join_inner.shape

(18878, 7)

In [72]:
# test if there is incomplete, there is reviews that has no pair in listings
df_listings_sample = df_listings.sample(frac=0.6)

In [74]:
# the number is decreasing because only matching listing_id is showed
df_join_inner2 = df_reviews.merge(df_listings_sample, on='listing_id', how='inner')
df_join_inner2.shape

(11755, 7)

#### Left Join

In [76]:
# all the data in left dataframe (df_reviews) will be outputed
df_join_left = df_reviews.merge(df_listings_sample, on='listing_id', how='left')
df_join_left.shape

(18878, 7)

In [78]:
# but for every data that didn;t have matched key in listings will have null values
df_join_left.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 18878 entries, 0 to 18877
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   listing_id      18878 non-null  int64
 1   review_date     18878 non-null  object
 2   host_id         11755 non-null  float64
 3   host_name       11755 non-null  object
 4   price           11755 non-null  float64
 5   name            11755 non-null  object
 6   minimum_nights  11755 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 1.2+ MB

#### Right Join

In [80]:
# all the data in right dataframe (df_reviews) will be outputed
df_join_right = df_reviews.merge(df_listings_sample, on='listing_id', how='right')
df_join_right.shape

(12402, 7)

In [81]:
# but for every data that didn;t have matched key in reviews will have null values
df_join_right.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12402 entries, 0 to 12401
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   listing_id      12402 non-null  int64
 1   review_date     11755 non-null  object
 2   host_id         12402 non-null  int64
 3   host_name       12402 non-null  object
 4   price           12402 non-null  int64
 5   name            12402 non-null  object
 6   minimum_nights  12402 non-null  int64
dtypes: int64(4), object(3)
memory usage: 775.1+ KB

#### Outer Join

In [83]:
# all the data in left and right dataframe will be outputed
df_join_outer = df_reviews.merge(df_listings_sample, on='listing_id', how='outer')
df_join_outer.shape

(19525, 7)

In [86]:
df_join_outer.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19525 entries, 0 to 19524
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   listing_id      19525 non-null  int64
 1   review_date     18878 non-null  object
 2   host_id         12402 non-null  float64
 3   host_name       12402 non-null  object
 4   price           12402 non-null  float64
 5   name            12402 non-null  object
 6   minimum_nights  12402 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 1.2+ MB

### Union / Concat

In [ ]:
df1 = pd.read_parquet('data/userdata1.parquet')
print(df1.columns)
print(df1.shape)

In [ ]:
df2 = pd.read_parquet('data/userdata2.parquet')
print(df2.columns)
print(df2.shape)